; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v11)
             (pred_3 ?v9 ?v2)
             (pred_4 ?v6 ?v2)
             (pred_1 ?v1 ?v6 )
	     (pred_5 ?v6)
             (pred_8 ?v4)
             (pred_12 ?v9)
             (pred_2 ?v2)
             (pred_7 ?v6)
             (pred_10 ?v9)
             (pred_11 ?v6)
             (pred_6 ))



(:action op_3
:parameters (?v13 ?v5 ?v8 ?v3)
:precondition (and (pred_8 ?v13) (pred_8 ?v5) (pred_12 ?v8) (pred_2 ?v3)
          (pred_9 ?v13 ?v5) (pred_3 ?v8 ?v3)
                   (pred_4 ?v5 ?v3) (pred_5 ?v13) 
                   (pred_7 ?v5) (pred_10 ?v8))
:effect (and  (pred_11 ?v5) (not (pred_7 ?v5))))


(:action op_2
:parameters (?v13 ?v7)
:precondition (and (pred_8 ?v13) (pred_8 ?v7)
               (pred_5 ?v13) (pred_9 ?v13 ?v7) (pred_11 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v13))))

(:action op_4
:parameters (?v13 ?v8)
:precondition (and (pred_8 ?v13) (pred_12 ?v8) 
                  (pred_5 ?v13) (pred_1 ?v8 ?v13) (pred_6 ))
:effect (and (pred_10 ?v8)
   (not (pred_1 ?v8 ?v13)) (not (pred_6 ))))


(:action op_5
:parameters (?v13 ?v10 ?v12)
:precondition (and (pred_8 ?v13) (pred_12 ?v10) (pred_12 ?v12)
                  (pred_5 ?v13) (pred_10 ?v12) (pred_1 ?v10 ?v13))
:effect (and (pred_10 ?v10) (pred_1 ?v12 ?v13)
        (not (pred_10 ?v12)) (not (pred_1 ?v10 ?v13))))

(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_8 ?v13) (pred_12 ?v8) 
                  (pred_5 ?v13) (pred_10 ?v8))
:effect (and (pred_6 ) (pred_1 ?v8 ?v13) (not (pred_10 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_10 obj_15 obj_20 obj_03 obj_28 obj_24 obj_23 obj_16 obj_21 obj_12 obj_11 obj_02 obj_30 obj_14 obj_31 obj_01 obj_27 obj_04 obj_25 obj_22 obj_29 obj_18 obj_08 obj_19
    obj_09 obj_17 obj_07
    obj_26 obj_06 obj_05
    )

    (:init
       (pred_6)

       (pred_8 obj_13)
       (pred_8 obj_10)
       (pred_8 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_03)
       (pred_8 obj_28)
       (pred_8 obj_24)
       (pred_8 obj_23)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_12)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_30)
       (pred_8 obj_14)
       (pred_8 obj_31)
       (pred_8 obj_01)
       (pred_8 obj_27)
       (pred_8 obj_04)
       (pred_8 obj_25)
       (pred_8 obj_22)
       (pred_8 obj_29)
       (pred_8 obj_18)
       (pred_8 obj_08)
       (pred_8 obj_19)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_07)
       (pred_12 obj_26)
       (pred_12 obj_06)
       (pred_12 obj_05)

       (pred_9 obj_13 obj_28)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_10 obj_24)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_15 obj_23)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_28 obj_12)
       (pred_9 obj_28 obj_24)
       (pred_9 obj_28 obj_13)
       (pred_9 obj_24 obj_11)
       (pred_9 obj_24 obj_23)
       (pred_9 obj_24 obj_10)
       (pred_9 obj_24 obj_28)
       (pred_9 obj_23 obj_02)
       (pred_9 obj_23 obj_16)
       (pred_9 obj_23 obj_15)
       (pred_9 obj_23 obj_24)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_16 obj_21)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_23)
       (pred_9 obj_21 obj_14)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_21 obj_16)
       (pred_9 obj_12 obj_31)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_28)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_24)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_02 obj_27)
       (pred_9 obj_02 obj_30)
       (pred_9 obj_02 obj_23)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_30 obj_04)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_02)
       (pred_9 obj_14 obj_25)
       (pred_9 obj_14 obj_21)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_31 obj_22)
       (pred_9 obj_31 obj_01)
       (pred_9 obj_31 obj_12)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_01 obj_27)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_31)
       (pred_9 obj_27 obj_18)
       (pred_9 obj_27 obj_04)
       (pred_9 obj_27 obj_02)
       (pred_9 obj_27 obj_01)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_04 obj_25)
       (pred_9 obj_04 obj_30)
       (pred_9 obj_04 obj_27)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_14)
       (pred_9 obj_25 obj_04)
       (pred_9 obj_22 obj_29)
       (pred_9 obj_22 obj_31)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_29 obj_22)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_27)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_08 obj_19)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_19 obj_08)
       (pred_7 obj_24)
       (pred_7 obj_18)
       (pred_7 obj_21)
       (pred_4  obj_24 obj_09)
       (pred_4  obj_18 obj_17)
       (pred_4  obj_21 obj_07)
       (pred_11 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_03)
       (pred_11 obj_28)
       (pred_11 obj_23)
       (pred_11 obj_16)
       (pred_11 obj_12)
       (pred_11 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_30)
       (pred_11 obj_14)
       (pred_11 obj_31)
       (pred_11 obj_01)
       (pred_11 obj_27)
       (pred_11 obj_04)
       (pred_11 obj_25)
       (pred_11 obj_22)
       (pred_11 obj_29)
       (pred_11 obj_08)
       (pred_11 obj_19)

       (pred_3  obj_26 obj_09)
       (pred_3  obj_06 obj_17)
       (pred_3  obj_05 obj_07)
       (pred_1 obj_26 obj_29)
       (pred_1 obj_06 obj_23)
       (pred_1 obj_05 obj_25)
       (pred_5 obj_23)
    )

    (:goal (and
       (pred_1 obj_05 obj_16)
    ))
(:constraints
  (always (not (pred_5 obj_30)))
)
)

; plan
1. (op_2 obj_23 obj_02)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_02)
   goals met: 0 of 1
2. (op_2 obj_02 obj_27)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_27)
   goals met: 0 of 1
3. (op_2 obj_27 obj_04)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_04)
   goals met: 0 of 1
4. (op_2 obj_04 obj_25)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_25)
   goals met: 0 of 1
5. (op_4 obj_25 obj_05)
   deleted: (pred_1 obj_05 obj_25) (pred_6)
   added: (pred_10 obj_05)
   goals met: 0 of 1
6. (op_2 obj_25 obj_14)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_14)
   goals met: 0 of 1
7. (op_3 obj_14 obj_21 obj_05 obj_07)
   deleted: (pred_7 obj_21)
   added: (pred_11 obj_21)
   goals met: 0 of 1
8. (op_2 obj_14 obj_21)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_21)
   goals met: 0 of 1
9. (op_2 obj_21 obj_16)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_16)
   goals met: 0 of 1
10. (op_1 obj_16 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_6) (pred_1 obj_05 obj_16)
   goals met: 1 of 1
